InformationRegisters/ИсчислениеНалоговСтруктурныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ИсчислениеНалоговСтруктурныхЕдиниц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НалоговыйКомитет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Налогоплательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделНалоговогоУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РазделыНалоговогоУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РазделыНалоговогоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>РазделыНалоговогоУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акциз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестныеНалоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогиСЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ИсчислениеНалоговСтруктурныхЕдиниц/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
		// подразделение, указываемое в регистре должно иметь признак Структурного подразделения
		Если ТипЗнч(ЗаписьНабора.СтруктурнаяЕдиница) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			Если ЗаписьНабора.СтруктурнаяЕдиница.ЯвляетсяСтруктурнымПодразделением = Ложь Тогда
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 не отмечено в справочнике подразделений организаций как структурное!'"), ЗаписьНабора.СтруктурнаяЕдиница);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "СтруктурнаяЕдиница", "Запись", Отказ);
				
			КонецЕсли;
		КонецЕсли;
					
		// Для НДС и КПН структурным подразделением не может являться подразделение
		Если ЗаписьНабора.РазделНалоговогоУчета = Перечисления.РазделыНалоговогоУчета.НДС
				Или ЗаписьНабора.РазделНалоговогоУчета = Перечисления.РазделыНалоговогоУчета.КПН Тогда
				
			Если ТипЗнч(ЗаписьНабора.СтруктурнаяЕдиница) <> Тип("СправочникСсылка.Организации") Тогда
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 - %2 : в качестве структурной единицы может выступать только организация!'"), ЗаписьНабора.СтруктурнаяЕдиница, ЗаписьНабора.РазделНалоговогоУчета);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "СтруктурнаяЕдиница", "Запись", Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецЕсли
